Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_network_interface.interface will be created
+ resource "azurerm_network_interface" "interface" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "network_interface"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "TF-Demo-RG"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "ip_configuration"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.nsg_associate will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_associate" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.nsg will be created
+ resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "TestSecurityGroup1"
      + resource_group_name = "TF-Demo-RG"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "port_22"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "public_ip"
      + resource_group_name     = "TF-Demo-RG"
      + sku                     = "Basic"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.rg will be created
+ resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "TF-Demo-RG"
    }

  # azurerm_subnet.internal will be created
+ resource "azurerm_subnet" "internal" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.30.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "TF-Demo-RG"
      + virtual_network_name                           = "TF-VNET1"
    }

  # azurerm_virtual_machine.server will be created
+ resource "azurerm_virtual_machine" "server" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "eastus"
      + name                             = "ubuntu_server_demo"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "TF-Demo-RG"
      + vm_size                          = "Standard_B2ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "student21"
          + computer_name  = "server"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "web_os_disk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_network.main will be created
+ resource "azurerm_virtual_network" "main" {
      + address_space         = [
          + "10.30.0.0/16",
        ]
      + dns_servers           = [
          + "10.0.1.4",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "eastus"
      + name                  = "TF-VNET1"
      + resource_group_name   = "TF-Demo-RG"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ web_server_public_ip = (known after apply)

##### Infracost estimate #####

Monthly cost will increase by $64.90

Previous monthly cost: $0.00
New monthly cost: $64.90

Infracost output:

    Project: ajinkya101/infracost-azure-atlantis/default.tfplan
    
    + azurerm_public_ip.public_ip
      +$2.63
    
        + IP address (static)
          +$2.63
    
    + azurerm_virtual_machine.server
      +$62.27
    
        + Instance usage (pay as you go, Standard_B2ms)
          +$60.74
    
        + Ultra disk reservation (if unattached)
          Monthly cost depends on usage
            +$4.38 per vCPU
    
        + storage_os_disk
        
            + Storage (S4)
              +$1.54
        
            + Disk operations
              Monthly cost depends on usage
                +$0.0005 per 10k operations
    
    Monthly cost change for ajinkya101/infracost-azure-atlantis/default.tfplan
    Amount:  +$64.90 ($0.00 -> $64.90)
    
    ----------------------------------
    Key: ~ changed, + added, - removed
    
    To estimate usage-based resources use --usage-file, see https://infracost.io/usage-file

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://infracost1-8687d56d7c-ghg5z:4141/lock?id=ajinkya101%252Finfracost-azure-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
